// 환자수 추이 chart
let orginData = [19959, 21269, 18967, 20476, 21155, 21282, 20440, 21787, 21206, 21123, 21877, 21009, 21301, 21167, 20371, 21084, 21192, 22094, 22340, 23087, 22088, 23305, 22496, 22801, 23181, 22906, 23107, 25515];
let orginLabels = ['2018-12', '2019-01', '2019-02', '2019-03', '2019-04', '2019-05', '2019-06', '2019-07', '2019-08', '2019-09', '2019-10', '2019-11', '2019-12', '2020-01', '2020-02', '2020-03', '2020-04', '2020-05', '2020-06', '2020-07', '2020-08', '2020-09', '2020-10', '2020-11', '2020-12', '2021-01', '2021-02', '2021-03']

let patient = document.getElementById("patient").getContext('2d');
let patientChart = new Chart(patient, {
    type: 'line',
    data: {
        labels: orginLabels,
        datasets : [{
            label : '환자수',
            data: orginData,
            borderColor: '#ff4b2b',
        }]
    },
    options: {
        plugins: {
            title: {
                display:true,
                text: '외래/입원환자 수 추이'
            }, 
            responsive:false
        }
    }
});

// 성별/연령 chart
let sexAge1 = document.getElementById('sexAge1').getContext('2d');
let sexAge_bar_chart = new Chart(sexAge1, {
  type: 'bar',
  data: {
      labels: ['0-9', '10-19', '20-29', '30-39', '40-49', '50-59', '60-69', '70-79', '80'],
      datasets: [{
          label: '# 남',
          data: [546, 6011, 18042, 20700, 27062, 32072, 34357, 27264, 12544],
          backgroundColor: [
              'rgba(54, 162, 235, 0.5)'
          ],
          borderColor: [
              'rgba(90, 162, 235, 1)',
          ],
          borderWidth: 1
          },
          {
          label: '# 여',
          data: [588, 6756, 25570, 28566, 37396, 50134, 65740, 51063, 25028],
          backgroundColor: [
              'rgba(255, 99, 132, 0.5)'
              
          ],
          borderColor: [
              'rgba(255, 99, 132, 1)'
          ],
          borderWidth: 1
        }
    ]
    },
    options: {
        plugins: {
            scales: {
                y: {
                    beginAtZero: true
                }
            },
            title: {
                display:true,
                text: '성별별 코로나 블루 특성'
            },
            responsive:false
        
        }
    }
});
let sexAge2 = document.getElementById('sexAge2').getContext('2d');
let sexAge_pie_chart = new Chart(sexAge2, {
    type: 'doughnut',
    data: {
        labels: ['0-9', '10-19', '20-29', '30-39', '40-49', '50-59', '60-69', '70-79', '80'],
        datasets: [{
            label: '# 남',
            data: [90415, 905522, 2794352, 2868808, 3285230, 3772975, 4333064, 3156063, 1448510],
            backgroundColor: [
                'rgba(255, 99, 132, 0.5)',
                'rgba(250, 158, 64, 0.5)',
                'rgba(252, 205, 86, 0.5)',
                'rgba(75, 192, 192, 0.5)',
                'rgba(54, 162, 235, 0.5)',
                'rgba(90, 100, 235, 0.5)',
                'rgba(153, 102, 255, 0.5)',
                'rgba(193, 132, 255, 0.5)',
                'rgba(201, 203, 207, 0.5)',
                
            ],
            borderColor: [
                'rgba(255, 99, 132, 0.5)',
                'rgba(250, 158, 64, 0.5)',
                'rgba(252, 205, 86, 0.5)',
                'rgba(75, 192, 192, 0.5)',
                'rgba(54, 162, 235, 0.5)',
                'rgba(153, 102, 255, 0.5)',
                'rgba(201, 203, 207, 0.5)',
                'rgba(90, 100, 235, 0.5)'
            ],
            borderWidth: 1
            },
            
    ]
    },
    options: {
        plugins:{
            scales: {
                y: {
                    beginAtZero: true
                }
            },
            responsive:false,
            title: {
                display:true,
                text: '연령별 요양급여비용총계'
            }
        }
    }
});

let keyword_label = [20200101, 20200107, 20200114, 20200121, 20200201, 20200207, 20200214, 20200221, 20200301, 20200307, 20200314, 20200321, 20200401, 20200407, 20200414, 20200421, 20200501, 20200507, 20200514, 20200521, 20200601, 20200607, 20200614, 20200621, 20200701, 20200707, 20200714, 20200721, 20200801, 20200807, 20200814, 20200821, 20200901, 20200907, 20200914, 20200921, 20201001, 20201007, 20201014, 20201021, 20201101, 20201107, 20201114, 20201121, 20201201, 20201207, 20201214, 20201221, 20210101, 20210107, 20210114, 20210121, 20210201, 20210207, 20210214, 20210221, 20210301, 20210307, 20210314, 20210321, 20210401, 20210407, 20210414, 20210421, 20210501, 20210507, 20210514, 20210521, 20210601, 20210607, 20210614, 20210621, 20210701, 20210707, 20210714, 20210721, 20210801, 20210807, 20210814, 20210821, 20210901, 20210907, 20210914, 20210921, 20211001, 20211007, 20211014, 20211021]

// 긍부정 누적 chart
let total_keyword = document.getElementById("total_keyword").getContext('2d');
let totalKeywordChart = new Chart(total_keyword, {
    type: 'bar',
    data: {
        labels: keyword_label
        ,
        datasets : [{
            label : '긍정',
            data: [180, 195, 203, 198, 216, 234, 157, 301, 362, 381, 409, 370, 371, 401, 333, 361, 344, 434, 326, 496, 276, 270, 265, 272, 283, 239, 261, 227, 294, 241, 280, 316, 339, 355, 316, 317, 249, 227, 296, 438, 481, 513, 277, 367, 350, 311, 320, 305, 348, 273, 302, 329, 255, 264, 286, 334, 230, 279, 285, 272, 264, 295, 278, 202, 266, 305, 243, 244, 255, 234, 243, 272, 225, 274, 221, 242, 223, 238, 309, 327, 267, 311, 256, 351, 352, 431, 0, 0],
            borderColor: '#',
            backgroundColor: 'rgba(80, 162, 235, 0.8)'
        },
        {
            label : '부정',
            data: [334, 328, 308, 318, 344, 338, 434, 540, 534, 484, 463, 486, 512, 449, 451, 360, 354, 413, 385, 360, 364, 380, 388, 371, 349, 393, 362, 630, 297, 367, 616, 540, 417, 388, 360, 387, 369, 298, 332, 389, 368, 357, 413, 395, 367, 423, 404, 388, 364, 421, 364, 314, 372, 380, 364, 373, 381, 368, 351, 362, 405, 349, 367, 343, 344, 374, 367, 351, 352, 357, 363, 340, 357, 321, 389, 420, 402, 373, 362, 368, 430, 431, 391, 496, 439, 484, 0, 0],
            borderColor: '#ff4b2b',
            backgroundColor: 'rgba(255, 99, 132, 1)'
        }]
    },
    options: {
        plugins: {
            title: {
                display: true,
                text: '전체 코로나 + 감정, 기분, 일상 긍부정 비율 그래프'
            },
        },
        responsive: true,

    }
});


let naver_sentiment = document.getElementById("naver_sentiment").getContext('2d');
let naverKeywordChart = new Chart(naver_sentiment, {
    type: 'bar',
    data: {
        labels: keyword_label,
        datasets : [{
            label : '긍정',
            data: [180, 195, 203, 193, 197, 202, 117, 148, 185, 183, 216, 190, 211, 207, 185, 224, 231, 195, 202, 210, 212, 197, 192, 209, 213, 182, 192, 192, 239, 184, 197, 173, 214, 242, 224, 229, 197, 223, 239, 190, 212, 239, 205, 242, 223, 200, 216, 210, 247, 195, 236, 263, 214, 202, 226, 226, 188, 223, 227, 218, 206, 240, 222, 187, 213, 231, 198, 205, 216, 189, 200, 217, 184, 239, 176, 172, 167, 185, 210, 228, 148, 166, 190, 187, 206, 204, 186, 235],
            borderColor: '#',
            backgroundColor: '#2DB400'
        },
        {
            label : '부정',
            data: [333, 327, 307, 317, 317, 310, 405, 373, 338, 343, 301, 332, 311, 307, 342, 297, 287, 329, 314, 309, 306, 318, 331, 313, 309, 330, 322, 319, 270, 329, 322, 344, 303, 279, 291, 284, 326, 292, 282, 324, 301, 282, 308, 271, 298, 325, 312, 310, 271, 323, 283, 248, 306, 311, 294, 282, 325, 291, 277, 290, 301, 262, 294, 326, 301, 285, 318, 300, 305, 317, 317, 301, 330, 280, 340, 340, 346, 325, 311, 290, 367, 342, 328, 327, 307, 303, 323, 272],
            borderColor: '#ff4b2b',
            backgroundColor: '#adb5bd'
        }]
    },
    options: {
        plugins: {
            title: {
                display: true,
                text: '네이버 코로나 + 감정, 기분, 일상'
            },
        },
        responsive: true,
        scales: {
            x: {
                stacked: true,
            },
            y: {
                stacked: true
            }
        }
    }
});

let twitter_sentiment = document.getElementById("twitter_sentiment").getContext('2d')
let twitterKeywordChart = new Chart(twitter_sentiment, {
    type: 'bar',
    data: {
        labels: keyword_label,
        datasets : [{
            label : '긍정',
            data: [0, 0, 0, 5, 19, 32, 40, 153, 177, 198, 193, 180, 160, 194, 148, 137, 113, 239, 124, 286, 64, 73, 73, 63, 70, 57, 69, 35, 55, 57, 83, 143, 125, 113, 92, 88, 52, 4, 57, 248, 269, 274, 72, 125, 127, 111, 104, 95, 101, 78, 66, 66, 41, 62, 60, 108, 42, 56, 58, 54, 58, 55, 56, 15, 53, 74, 45, 39, 39, 45, 43, 55, 41, 35, 45, 70, 56, 53, 99, 99, 119, 145, 66, 164, 146, 227],
            borderColor: 'rgba(54, 162, 235, 0.5)',
            backgroundColor: '#00acee'
        },
        {
            label : '부정',
            data: [1, 1, 1, 1, 27, 28, 29, 167, 196, 141, 162, 154, 201, 142, 109, 63, 67, 84, 71, 51, 58, 62, 57, 58, 40, 63, 40, 311, 27, 38, 294, 196, 114, 109, 69, 103, 43, 6, 50, 65, 67, 75, 105, 124, 69, 98, 92, 78, 93, 98, 81, 66, 66, 69, 70, 91, 56, 77, 74, 72, 104, 87, 73, 17, 43, 89, 49, 51, 47, 40, 46, 39, 27, 41, 49, 80, 56, 48, 51, 78, 63, 89, 63, 169, 132, 181],
            borderColor: 'rgba(54, 162, 235, 0.5)',
            backgroundColor: '#adb5bd'
        }]
    },
    options: {
        plugins: {
            title: {
                display: true,
                text: '트위터 코로나 + 감정, 기분, 일상'
            },
        },
        responsive: true,
        scales: {
            x: {
                stacked: true,
            },
            y: {
                stacked: true
            }
        }
    }
});

let test_sentiment = document.getElementById('test-sentiment').getContext('2d');
let testSentimentchart = new Chart(test_sentiment, {
    type: 'doughnut',
    data: {
        labels: ['부정', '긍정'],
        datasets: [{
            label: '',
            data: [0.5, 0.5],
            backgroundColor: [
                'rgba(255, 99, 132, 0.5)',
                // 'rgba(250, 158, 64, 0.5)',
                // 'rgba(252, 205, 86, 0.5)',
                'rgba(75, 192, 192, 0.5)',
                // 'rgba(54, 162, 235, 0.5)',
                // 'rgba(90, 100, 235, 0.5)',
                // 'rgba(153, 102, 255, 0.5)',
                // 'rgba(193, 132, 255, 0.5)',
                // 'rgba(201, 203, 207, 0.5)',
                
            ],
            borderColor: [
                'rgba(255, 99, 132, 0.5)',
                // 'rgba(250, 158, 64, 0.5)',
                // 'rgba(252, 205, 86, 0.5)',
                'rgba(75, 192, 192, 0.5)',
                // 'rgba(54, 162, 235, 0.5)',
                // 'rgba(153, 102, 255, 0.5)',
                // 'rgba(201, 203, 207, 0.5)',
                // 'rgba(90, 100, 235, 0.5)'
            ],
            borderWidth: 1
            },
            
    ]
    },
    options: {
        responsive:false,
        plugins: {
            scales: {
                y: {
                    beginAtZero: true
                }
            },
            
            title: {
                display:true,
                text: '나의 글 감정분석 결과'
            }
        }
    }
});
